# Pandas Package

* Python library for data analysis
* High-performance containers for data analysis
* Data structures with a lot of functionality
* Meaningful labels
* handle data in a way suited to analysis
similar to R

#### Instalation
pip install pandas

In [1]:
import pandas as pd

## 1. Series

In [2]:
ser=pd.Series([1,2,3],index=["a","b","c"])
ser

a    1
b    2
c    3
dtype: int64

In [3]:
ser[0]

1

In [4]:
ser["a"]

1

In [5]:
# to_dict()
ser.to_dict()

{'a': 1, 'b': 2, 'c': 3}

In [6]:
# define with dictonary
d={"a":12,"b":[1,2,3],"c":"alii"}

In [9]:
ser2=pd.Series(d)
ser2

a           12
b    [1, 2, 3]
c         alii
dtype: object

## 2. DataFrame

In [31]:
# input excel file :"dataset.xlsx"
# try header, index_col, names and nrows 
df=pd.read_excel("dataset.xlsx",header=[0])
# df=pd.DataFrame(df,columns=["City","ID"])
df.head()

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
0,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
1,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
2,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
3,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
4,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN

In [26]:
#shape
df.shape

(6962, 10)

In [30]:
#columns
df.columns=range(10)
df.columns

RangeIndex(start=0, stop=10, step=1)

In [32]:
#index
df.index
df.head()

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
0,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
1,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
2,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
3,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
4,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN

In [33]:
#head() 
df.head(8)

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
0,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
1,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
2,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
3,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
4,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN
5,25974,B07625,OREGON COL OF ORIENTAL MEDICINE,10525 SE CHERRY BLOSSOM DR,PORTLAND,OR,97216,NaN,NaN,NaN
6,25975,B08041,ALFRED ADLER GRADUATE SCHOOL,1001 WEST HIGHWAY 7 SUITE 344,HOPKINS,MN,55305,NaN,NaN,NaN
7,25976,B08083,UNIV OF THE DIST OF COLU -SCHOOL OF LAW,4200 CONNECTICUT AVENUE NW,WASHINGTON,DC,20008,NaN,NaN,NaN

In [34]:
#tail()
df.tail(3)

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
6959,32928,042534,CLOVIS COMMUNITY COLLEGE,10309 NORTH WILLOW AVENUE,FRESNO,CA,93730,NaN,NaN,NaN
6960,32929,042577,TOTALLY COSMO SCHOOL OF MODERN COSMETOLO,110 NORTH BROADWAY,BROKEN BOW,OK,74728,NaN,NaN,NaN
6961,32930,042488,WONGU UNIVERSITY OF ORIENTAL MEDICINE,8620 SOUTH EASTERN AVENUE,LAS VEGAS,NV,89123,NaN,NaN,NaN

In [35]:
#extract a small part as df2
df2= df.head(5)
df2

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
0,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
1,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
2,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
3,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
4,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN

In [36]:
#index
df2.index=["a1","a2","a3","a4","a5"]
df2

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
a1,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
a2,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
a3,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
a4,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
a5,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN

In [39]:
#col name
df2.columns=["col1","col2","col3","col4","col5","col6","col7","col8","col9","col10"]
df2.head(5)

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10
a1,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
a2,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
a3,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
a4,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
a5,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN

In [40]:
#index.name
df2.index.name="str"
df2

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10
str,,,,,,,,,,
a1,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
a2,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
a3,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
a4,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
a5,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN

In [44]:
#define df_class with dictionary and assign student Id as index
d={"Student":["a","b","c","d","e"],
    "Math_grade":[13,10,18,20,7],
    "Physics_grade":[2,12,20,15,10]}
studentId=[1001,1002,1003,1004,1005]

In [45]:
df_class=pd.DataFrame(d,index=studentId)
df_class

      Math_grade  Physics_grade Student
1001          13              2       a
1002          10             12       b
1003          18             20       c
1004          20             15       d
1005           7             10       e

In [49]:
#sum()
df_class.sum()

Math_grade          68
Physics_grade       59
Student          abcde
dtype: object

In [47]:
#sum axis 1
df_class.sum(axis=1)

1001    15
1002    22
1003    38
1004    35
1005    17
dtype: int64

In [52]:
# min and min axis =1
df_class.min(axis=0)
df_class.min(axis=1)

1001     2
1002    10
1003    18
1004    15
1005     7
dtype: int64

In [66]:
#idxmin axis 0 and 1
df_class[["Math_grade","Physics_grade"]].idxmin(axis=1)

1001    Physics_grade
1002       Math_grade
1003       Math_grade
1004    Physics_grade
1005       Math_grade
dtype: object

In [78]:
#describe()
df_class.describe()
df_class.apply(pd.DataFrame.describe,axis=1)

      count  unique top  freq
1001      3       3   2     1
1002      3       3  10     1
1003      3       3   c     1
1004      3       3  15     1
1005      3       3   7     1

In [69]:
df_class.mean(axis=1)

1001     7.5
1002    11.0
1003    19.0
1004    17.5
1005     8.5
dtype: float64

#### Recalling and Slicing

In [71]:
#recall "City" col and print type
df["City"]
df["City"][4:8]

4      PORTLAND
5      PORTLAND
6       HOPKINS
7    WASHINGTON
Name: City, dtype: object

In [76]:
#"City" col and rows 3 to 5
df[["City","SchoolName"]][3:6]

       City                             SchoolName
3   CHICAGO  THE CHICAGO SCHOOL OF PROF PSYCHOLOGY
4  PORTLAND   NATIONAL COLLEGE OF NATURAL MEDICINE
5  PORTLAND        OREGON COL OF ORIENTAL MEDICINE

In [77]:
# df["City",3:5] ==> error
df["City",3:5]

TypeError: unhashable type: 'slice'

In [79]:
df2

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10
str,,,,,,,,,,
a1,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
a2,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
a3,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
a4,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
a5,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN

In [82]:
# add "new" col with values [11,23,12,65,4]
df2["new"]=[11,23,12,65,4]
df2

C:\Users\raminka\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10,new
str,,,,,,,,,,,
a1,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN,11
a2,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN,23
a3,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN,12
a4,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN,65
a5,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN,4

In [84]:
# Conditional recalling City : CHICAGO and StateCode : IL   head(10)
df[(df["City"]=="CHICAGO") & (df["StateCode"]=="IL")].head(10)

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
3,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
46,26015,E00377,UNIVERSITY OF CHICAGO GRADUATE,"970 EAST 58TH STREET, RM 411",CHICAGO,IL,60637,NaN,NaN,NaN
74,26043,E00512,"UNIV OF CHICAGO, BOOTH SCH OF BUS",5807 S. WOODLAWN,CHICAGO,IL,60637,NaN,NaN,NaN
142,26111,E00773,CHICAGO KENT COLLEGE OF LAW,565 W ADAMS STREET,CHICAGO,IL,60661,NaN,NaN,NaN
204,26173,E00983,PACIFIC COLLEGE OF ORIENTAL MEDICINE - C,65 E. WACKER PLACE,CHICAGO,IL,60601,NaN,NaN,NaN
627,26596,G01661,CHICAGO THEOLOGICAL SEMINARY,5757 S. UNIVERSITY AVENUE,CHICAGO,IL,60637,NaN,NaN,NaN
629,26598,G01698,JOHN MARSHALL LAW SCHOOL,315 S PLYMOUTH CT,CHICAGO,IL,60604,NaN,NaN,NaN
630,26599,G01712,LUTHERAN SCHOOL OF THEOL AT CHICAGO,1100 EAST 55TH STREET,CHICAGO,IL,60615,NaN,NaN,NaN
631,26600,G01721,MCCORMICK THEOLOGICAL SEMINARY,5460 S. UNIVERSITY AVENUE,CHICAGO,IL,60615,NaN,NaN,NaN
632,26601,G01723,MEADVILLE LOMBARD THEOLOGICAL SCHOOL,5701 SOUTH WOODLAWN AVENUE,CHICAGO,IL,60637,NaN,NaN,NaN

In [92]:
#iloc row3 1:4 and cols 3:6
df.iloc[1:4,3:6]
df.iloc[1:4,[2,5]]

                              SchoolName StateCode
1    CENTER FOR ADVANCED STUDIES OF PUER        PR
2       PENTECOSTAL THEOLOGICAL SEMINARY        TN
3  THE CHICAGO SCHOOL OF PROF PSYCHOLOGY        IL

In [89]:
# loc rows ["a","e"] and cols ["col1","col2"] from df2
df2.head()
df2.loc[["a1","a3"],["col3","col5"]]

                                 col3        col5
str
a1    WIDENER UNIV SCHOOL OF LAW - DE  WILMINGTON
a3   PENTECOSTAL THEOLOGICAL SEMINARY   CLEVELAND

In [99]:
#add rows "f" with values [1,2,3,4] and "g" with values 1
df2.loc["f"]=[1,2,3,4,5,6,7,8,9,10,11]
df2.loc["e"]=5
df2

C:\Users\raminka\Anaconda3\lib\site-packages\pandas\core\indexing.py:537: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self.obj[item] = s
C:\Users\raminka\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10,new
str,,,,,,,,,,,
a1,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN,11
a2,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN,23
a3,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN,12
a4,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN,65
a5,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN,4
f,1,2,3,4,5,6,7,8,9,10,11
e,5,5,5,5,5,5,5,5,5,5,5

In [100]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, a1 to e
Data columns (total 11 columns):
col1     7 non-null int64
col2     7 non-null object
col3     7 non-null object
col4     7 non-null object
col5     7 non-null object
col6     7 non-null object
col7     7 non-null int64
col8     2 non-null object
col9     2 non-null object
col10    2 non-null object
new      7 non-null int64
dtypes: int64(3), object(8)
memory usage: 672.0+ bytes

In [104]:
# delete new column from df2 
del df2["new"]
df3=df2.iloc[0:-1]
df3

,col1,col2,col3,col4,col5,col6,col7,col8,col9,col10
str,,,,,,,,,,
a1,25969,B04724,WIDENER UNIV SCHOOL OF LAW - DE,4601 CONCORD PIKE/PO BOX 7474,WILMINGTON,DE,19803,NaN,NaN,NaN
a2,25970,B06171,CENTER FOR ADVANCED STUDIES OF PUER,BOX S-4467,SAN JUAN,PR,902,NaN,NaN,NaN
a3,25971,B06511,PENTECOSTAL THEOLOGICAL SEMINARY,PO BOX 3330,CLEVELAND,TN,37320,NaN,NaN,NaN
a4,25972,B07022,THE CHICAGO SCHOOL OF PROF PSYCHOLOGY,325 NORTH WELLS STREET,CHICAGO,IL,60610,NaN,NaN,NaN
a5,25973,B07624,NATIONAL COLLEGE OF NATURAL MEDICINE,049 SW PORTER,PORTLAND,OR,97201,NaN,NaN,NaN
f,1,2,3,4,5,6,7,8,9,10

In [105]:
# export csv or excel file from df2
df2.to_excel("df2.xlsx")

In [111]:
# sort_values df_class by "Math_grade" ascending
df_class.sort_values(["Math_grade"],ascending=1)

      Math_grade  Physics_grade Student
1005           7             10       e
1002          10             12       b
1001          13              2       a
1003          18             20       c
1004          20             15       d

## 3. Excercises

1. Import the "dataset.xlsx" file and print all "CHICAGO" city's schools

In [5]:
df11=pd.read_excel("dataset.xlsx",header=0)
pd.DataFrame(df11[df11["City"]=="CHICAGO"],columns=["SchoolName","City"])

                                    SchoolName     City
3        THE CHICAGO SCHOOL OF PROF PSYCHOLOGY  CHICAGO
46              UNIVERSITY OF CHICAGO GRADUATE  CHICAGO
74           UNIV OF CHICAGO, BOOTH SCH OF BUS  CHICAGO
142                CHICAGO KENT COLLEGE OF LAW  CHICAGO
204   PACIFIC COLLEGE OF ORIENTAL MEDICINE - C  CHICAGO
627               CHICAGO THEOLOGICAL SEMINARY  CHICAGO
629                   JOHN MARSHALL LAW SCHOOL  CHICAGO
630        LUTHERAN SCHOOL OF THEOL AT CHICAGO  CHICAGO
631             MCCORMICK THEOLOGICAL SEMINARY  CHICAGO
632       MEADVILLE LOMBARD THEOLOGICAL SCHOOL  CHICAGO
791                 CATHOLIC THEOLOGICAL UNION  CHICAGO
820        UNIV OF CHICAGO PRITZKER SCH OF MED  CHICAGO
931         ADLER SCH OF PROFESSIONAL PSYCHLGY  CHICAGO
1029        INSTITUTE FOR CLINICAL SOCIAL WORK  CHICAGO
1123                         ERIKSON INSTITUTE  CHICAGO
1643                   AMERICAN ACADEMY OF ART  CHICAGO
1652                  CITY COLLEGES OF CHICAGO  CHICAGO
1653                            TRUMAN COLLEGE  CHICAGO
1654                   RICHARD J DALEY COLLEGE  CHICAGO
1655        CITY COLLEGES OF CHICAGO-MALCOLM X  CHICAGO
1656                 HAROLD WASHINGTON COLLEGE  CHICAGO
1657                      OLIVE-HARVEY COLLEGE  CHICAGO
1658                      KENNEDY KING COLLEGE  CHICAGO
1659                            WRIGHT COLLEGE  CHICAGO
1662                           SPERTUS COLLEGE  CHICAGO
1664                          COLUMBIA COLLEGE  CHICAGO
1667                         DEPAUL UNIVERSITY  CHICAGO
1676             ILLINOIS COLLEGE OF OPTOMETRY  CHICAGO
1677          ILLINOIS INSTITUTE OF TECHNOLOGY  CHICAGO
1679                NORTHEASTERN ILLINOIS UNIV  CHICAGO
...                                        ...      ...
3898            CANNELLA SCHOOL OF HAIR DESIGN  CHICAGO
3935                           RUSH UNIVERSITY  CHICAGO
4077                          DEVRY UNIVERSITY  CHICAGO
4176                 TAYLOR BUSINESS INSTITUTE  CHICAGO
4251                      NORTHWESTERN COLLEGE  CHICAGO
4281           ILLINOIS INSTITUTE OF ART (THE)  CHICAGO
4383              HARRINGTON COLLEGE OF DESIGN  CHICAGO
4418                    TELSHE YESHIVA-CHICAGO  CHICAGO
4491                MAC DANIEL'S BEAUTY SCHOOL  CHICAGO
4734                     SANFORD-BROWN COLLEGE  CHICAGO
4753                      EAST WEST UNIVERSITY  CHICAGO
4774                      ST AUGUSTINE COLLEGE  CHICAGO
5007         WESTWOOD COLLEGE - O'HARE AIRPORT  CHICAGO
5102            CANNELLA SCHOOL OF HAIR DESIGN  CHICAGO
5121   LE CORDON BLEU COLLEGE OF CULINARY ARTS  CHICAGO
5300                         ARGOSY UNIVERSITY  CHICAGO
5305                   RESURRECTION UNIVERSITY  CHICAGO
5566               ROSEL SCHOOL OF COSMETOLOGY  CHICAGO
5689       NATIONAL LATINO EDUCATION INSTITUTE  CHICAGO
5832             BUSINESS INDUSTRIAL RESOURCES  CHICAGO
5837               CORTIVA INSTITUTE - CHICAGO  CHICAGO
5852          PAUL MITCHELL THE SCHOOL CHICAGO  CHICAGO
6046   SOMA INSTITUTE - THE NATIONAL SCHOOL OF  CHICAGO
6182                    LARRY'S BARBER COLLEGE  CHICAGO
6268            UNIVERSITY OF AESTHETICS (THE)  CHICAGO
6272      TRICOCI UNIVERSITY OF BEAUTY CULTURE  CHICAGO
6281                 MIDWESTERN CAREER COLLEGE  CHICAGO
6292                   AVEDA INSTITUTE CHICAGO  CHICAGO
6608     TRIBECA FLASHPOINT MEDIA ARTS ACADEMY  CHICAGO
6812                  HVAC TECHNICAL INSTITUTE  CHICAGO

[76 rows x 2 columns]

2 . From given data set print last five rows with iloc method

In [6]:
df11.iloc[-5:]

,ID,SchoolCode,SchoolName,Address,City,StateCode,ZipCode,Province,Country,PostalCode
6957,32926,E40436,FLORIDA CAREER COLLEGE - UEI COLLEGE - H,70-A FARM TO MARKET ROAD 1960 WEST,HOUSTON,TX,77090,NaN,NaN,NaN
6958,32927,042496,WESTCLIFF UNIVERSITY,4199 CAMPUS DRIVE #650,IRVINE,CA,92612,NaN,NaN,NaN
6959,32928,042534,CLOVIS COMMUNITY COLLEGE,10309 NORTH WILLOW AVENUE,FRESNO,CA,93730,NaN,NaN,NaN
6960,32929,042577,TOTALLY COSMO SCHOOL OF MODERN COSMETOLO,110 NORTH BROADWAY,BROKEN BOW,OK,74728,NaN,NaN,NaN
6961,32930,042488,WONGU UNIVERSITY OF ORIENTAL MEDICINE,8620 SOUTH EASTERN AVENUE,LAS VEGAS,NV,89123,NaN,NaN,NaN

3 . print the BOSTON City's "SchoolName" and their "Address"

In [7]:
pd.DataFrame(df11[df11["City"]=="BOSTON"],columns=["SchoolName","Address"])

                                    SchoolName                     Address
32              HARVARD UNIV SCH PUBLIC HEALTH          708 HUNTINGTON AVE
63                 HARVARD UNIV MEDICAL SCHOOL              25 SHATTUCK ST
72                     HARVARD BUSINESS SCHOOL                SPANGLER CTR
73              HARVARD SCH OF DENTAL MEDICINE            188 LONGWOOD AVE
79           TUFTS UNIV SCH OF DENTAL MEDICINE              1 KNEELAND STR
80               TUFTS UNIV SCHOOL OF MEDICINE            136 HARRISON AVE
784                   NEW ENGLAND LAW | BOSTON           154 STUART STREET
953          MASS GEN HOSP DIETETIC INTERNSHIP    FRUIT STREET - GRBBA-005
958                      WILLIAM JAMES COLLEGE        221 RIVERMOOR STREET
983         MGH INSTITUTE OF HEALTH PROFESSION                36 FIRST AVE
1971                  BERKLEE COLLEGE OF MUSIC        1140 BOYLSTON STREET
1973              BOSTON CONSERVATORY OF MUSIC                8 THE FENWAY
1974                         BOSTON UNIVERSITY        881 COMMONWEALTH AVE
1982                           EMERSON COLLEGE         120 BOYLSTON STREET
1983                          EMMANUEL COLLEGE              400 THE FENWAY
1985                            FISHER COLLEGE           118 BEACON STREET
1986       BENJAMIN FRANKLIN INSTITUTE OF TECH              41 BERKELEY ST
1994          NEW ENGLAND COLLEGE OF OPTOMETRY               424 BEACON ST
1995  MASS. COLLEGE OF PHARMACY  & HEALTH SCIE            179 LONGWOOD AVE
2008   MASSACHUSETTS COLLEGE OF ART AND DESIGN          621 HUNTINGTON AVE
2019         NEW ENGLAND CONSERVATORY OF MUSIC          290 HUNTINGTON AVE
2021                   NORTHEASTERN UNIVERSITY          360 HUNTINGTON AVE
2025                           SIMMONS COLLEGE              300 THE FENWAY
2031                        SUFFOLK UNIVERSITY              8 ASHBURTON PL
2034              UNIV OF MASSACHUSETTS-BOSTON          100 MORRISSEY BLVD
2036         WENTWORTH INSTITUTE OF TECHNOLOGY          550 HUNTINGTON AVE
2039                          WHEELOCK COLLEGE                200 RIVERWAY
3165                         BAY STATE COLLEGE        122 COMMONWEALTH AVE
3166              BOSTON ARCHITECTURAL COLLEGE              320 NEWBURY ST
3252             SCHOOL OF MUSEUM OF FINE ARTS              230 THE FENWAY
3452                           LABOURE COLLEGE         2120 DORCHESTER AVE
4745         NEW ENGLAND SCHOOL OF PHOTOGRAPHY        537 COMMONWEALTH AVE
4798                NORTH BENNET STREET SCHOOL          39 NORTH BENNET ST
5693                   URBAN COLLEGE OF BOSTON  178 TREMONT ST - 7TH FLOOR
5743                    BOSTON BAPTIST COLLEGE        950 METROPOLITAN AVE
6083            NEW ENGLAND COLLEGE OF FINANCE              10 HIGH STREET
6756                    JUPITER BEAUTY ACADEMY          15-17 FREEPORT WAY

4 . Count total schools per city

hint : df["colName"].value_counts()

In [14]:
df11.loc[:,"City"].value_counts()

NEW YORK             89
CHICAGO              76
HOUSTON              60
LOS ANGELES          57
CAMBRIDGE            50
BROOKLYN             48
MIAMI                46
OXFORD               43
PHILADELPHIA         40
SAN ANTONIO          37
WASHINGTON           37
BOSTON               37
LONDON               37
PORTLAND             36
DALLAS               35
PITTSBURGH           35
SAN DIEGO            35
COLUMBUS             33
JACKSONVILLE         32
KANSAS CITY          30
INDIANAPOLIS         30
ATLANTA              29
CLEVELAND            28
BALTIMORE            28
SPRINGFIELD          28
ROCHESTER            27
NASHVILLE            27
COLUMBIA             26
CINCINNATI           25
TAMPA                24
                     ..
BOURNE                1
SHOREWOOD             1
TIGERVILLE            1
SISSETON              1
PASCO                 1
UNITY                 1
BLUEBELL              1
BENSALEM              1
CALMAR                1
PLANTATION            1
WHITING               1
MEXICO                1
SOUTH HADLEY          1
ROSEMOUNT             1
GRENADA               1
CUTHBERT              1
MINEOLA               1
CHESTERTOWN           1
ITTA BENA             1
BRENHAM               1
FARMINGDALE           1
NEW CARROLLTON        1
HATILLO               1
WESTVILLE             1
FREELAND              1
LOCUST GROVE          1
CRAFTSBURY COMMON     1
BAYTOWN               1
WHITEWATER            1
BEATTYVILLE           1
Name: City, Length: 2524, dtype: int64

5 . import the "Automobile_data.csv" file into df_cars variable and assign the first row in the csv file as header and the first column as index_col. Then, print the first 5 rows of df_cars

In [17]:
df_cars=pd.read_csv("Automobile_data.csv",header=0,index_col=0)
df_cars.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

6 . sort the df_car dataframe by the price column

In [19]:
df_cars.sort_values(["price"],ascending=0).head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0
14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0

7 . Concatenate two data frames using following conditions

Hint: pd.concat([dataframe1,dataframe2])

In [21]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'], 
              'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 
                'Price': [29995, 23600, 61500 , 58900]}

In [22]:
g=pd.DataFrame(GermanCars)
j=pd.DataFrame(japaneseCars)
pd.concat([g,j])

       Company   Price
0         Ford   23845
1     Mercedes  171995
2          BMV  135925
3         Audi   71400
0       Toyota   29995
1        Honda   23600
2       Nissan   61500
3  Mitsubishi    58900

8 . Merge two data frames using following condition

hint: pd.merge(dataframe1,dataframe2,on="colName")

In [23]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'],
             'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'],
                  'horsepower': [141, 80, 182 , 160]}

In [24]:
pd.merge(pd.DataFrame(Car_Price),pd.DataFrame(car_Horsepower),on="Company")

  Company   Price  horsepower
0  Toyota   23845         141
1   Honda   17995          80
2     BMV  135925         182
3    Audi   71400         160